Amiya200/stm32_water_tank/Core/Src/screen.c
    const char *mode;
    if      (ModelHandle_IsRestartActive()) mode = "Refill ";
    else if (ModelHandle_IsVoltageFault())  mode = "VOLTERR";
    else if (ModelHandle_IsOverload())      mode = "OVERLD ";
    else if (ModelHandle_IsUnderload())     mode = "UNDERLD";
    else if (timerActive)                   mode = "AUTO(T)";
    else if (autoActive)        mode = motorOn ? "AUTO   " : "AUTO W";
    else if (countdownActive)   mode = motorOn ? "COUNT  " : "CD WAIT";
    else if (twistActive)       mode = motorOn ? "TWIST  " : "TWIST W";
    else if (semiAutoActive)    mode = motorOn ? "SEMI   " : "SEMI";
    else if (manualActive)      mode = "MANUAL ";
    else if (tankFull)          mode = "FULL   ";
    else if (dash_countdown_shown) mode = "COUNT  ";
    else if (dash_semi_shown)      mode = "SEMI   ";
    else                           mode = "READY  ";

    if (dash_page == 0)
    {
        snprintf(l0, sizeof(l0), "%-7sM:%-3s%3d%%", mode, motorOn ? "ON " : "OFF", tankPercent);
        if (tankFull)
            snprintf(l1, sizeof(l1), "TANK FULL %02u:%02u", time.hour, time.min);
        else if (!senseDryRun)
            snprintf(l1, sizeof(l1), "G.W:%-3s DRY%02u:%02u", gw, time.hour, time.min);
        else
            snprintf(l1, sizeof(l1), "G.W:%-3s    %02u:%02u",  gw, time.hour, time.min);
        lcd_line0(l0); lcd_line1(l1);
    }
    else
    {
        const char *dow = "---";
        if (time.dow >= 1 && time.dow <= 7) dow = dowNames[(time.dow - 1) % 7];
        snprintf(l0, sizeof(l0), "%02u:%02u %3.0fV %4.1fA", time.hour, time.min, g_voltageV, g_currentA);
        snprintf(l1, sizeof(l1), "%-12.12s", dow);
        lcd_line0(l0); lcd_line1(l1);
    }
    (void)dryFSMState; (void)dryEnabled; (void)sensorHasWater;
}

static void draw_menu_cursor(void)
{
    if (ui != UI_MENU) return;
    uint8_t row = 255;
    if      (menu_idx == menu_view_top)     row = 0;
    else if (menu_idx == menu_view_top + 1) row = 1;
    if (row <= 1) { lcd_put_cur(row, 0); lcd_send_data('>'); }
}

static void show_menu(void)
{
    char l0[17], l1[17];
    if (menu_idx < menu_view_top)             menu_view_top = menu_idx;
    else if (menu_idx > menu_view_top + 1)    menu_view_top = menu_idx - 1;
    snprintf(l0, sizeof(l0), " %-15.15s", main_menu[menu_view_top]);
    if (menu_view_top + 1 < MAIN_MENU_COUNT)
        snprintf(l1, sizeof(l1), " %-15.15s", main_menu[menu_view_top + 1]);
    else
        snprintf(l1, sizeof(l1), "                ");
    lcd_line0(l0); lcd_line1(l1); draw_menu_cursor();
}

static void show_devset_menu(void)
{
    char l0[17], l1[17];
    if (devset_idx < devset_view_top)           devset_view_top = devset_idx;
    else if (devset_idx > devset_view_top + 1)  devset_view_top = devset_idx - 1;
    uint8_t idx0 = devset_view_top, idx1 = devset_view_top + 1;
    char star0 = ' ', star1 = ' ';
    for (int pass = 0; pass < 2; pass++)
    {
        uint8_t idx  = (pass == 0) ? idx0 : idx1;
        char   *star = (pass == 0) ? &star0 : &star1;
        switch (idx)
        {
            case 0: if (edit_settings_dry_en)       *star = '*'; break;
            case 1: if (edit_settings_gap_s > 0)    *star = '*'; break;
            case 2: if (edit_settings_retry > 0)    *star = '*'; break;
            case 3: if (edit_settings_uv > 0)       *star = '*'; break;
            case 4: if (edit_settings_ov > 0)       *star = '*'; break;
            case 5: if (edit_settings_ol > 0)       *star = '*'; break;
            case 6: if (edit_settings_ul > 0)       *star = '*'; break;
            case 7: if (edit_settings_maxrun > 0)   *star = '*'; break;
            default: break;
        }
    }
    if (idx0 < DEVSET_MENU_COUNT)
        snprintf(l0, sizeof(l0), "%c%c%-14.14s", (devset_idx==idx0?'>':' '), star0, devset_menu_items[idx0]);
    else snprintf(l0, sizeof(l0), "                ");
    if (idx1 < DEVSET_MENU_COUNT)
        snprintf(l1, sizeof(l1), "%c%c%-14.14s", (devset_idx==idx1?'>':' '), star1, devset_menu_items[idx1]);
    else snprintf(l1, sizeof(l1), "                ");
    lcd_line0(l0); lcd_line1(l1);
}

static void show_timer_slot_select(void)
{
    int item1 = timer_page * 2, item2 = item1 + 1;
    char l0[17], l1[17];
    if (item1 == 5) snprintf(l0, sizeof(l0), "%c Back", (currentSlot==5?'>':' '));
    else            snprintf(l0, sizeof(l0), "%c Timer %d", (currentSlot==item1?'>':' '), item1+1);
    if (item2 <= 5)
    {
        if (item2 == 5) snprintf(l1, sizeof(l1), "%c Back", (currentSlot==5?'>':' '));
        else            snprintf(l1, sizeof(l1), "%c Timer %d", (currentSlot==item2?'>':' '), item2+1);
    }
    else snprintf(l1, sizeof(l1), "                ");
    lcd_line0(l0); lcd_line1(l1);
}

static void show_edit_on_time(void)  {}
static void show_edit_off_time(void) {}

static const char* dayNames[] = {
    "Enable All","Disable All","Mon","Tue","Wed","Thu","Fri","Sat","Sun","Next>"
};

static void show_timer_days(void)
{
    lcd_line0("Timer Days"); char buf[17];
    if (edit_day_index >= 2 && edit_day_index <= 8)
    {
        uint8_t d = edit_day_index - 2, isOn = (edit_day_mask >> d) & 1;
        snprintf(buf, sizeof(buf), "> %s (%s)", dayNames[edit_day_index], isOn?"ON":"OFF");
    }
    else snprintf(buf, sizeof(buf), "> %s", dayNames[edit_day_index]);
    lcd_line1(buf);
}
static void show_timer_gap(void)
{
    lcd_line0("Timer Gap (min)"); char buf[17];
    snprintf(buf, sizeof(buf), ">T%u %3u min Next>", (unsigned)(currentSlot+1), (unsigned)edit_gap_min);
    lcd_line1(buf);
}
static void show_timer_enable(void)
{
    char title[17]; snprintf(title, sizeof(title), "T%u Enable?", (unsigned)(currentSlot+1));
    lcd_line0(title); lcd_line1(edit_slot_enabled ? "YES       Next>" : "NO        Next>");
}
static void show_timer_summary(void)
{
    char title[17]; snprintf(title, sizeof(title), "T%u Summary", (unsigned)(currentSlot+1));
    lcd_line0(title); lcd_line1(edit_slot_enabled ? "Enabled     Next>" : "Disabled    Next>");
}
static void show_auto_menu(void)    { lcd_line0("Auto Settings"); lcd_line1(">Gap/Max/Retry"); }
static void show_auto_gap(void)     { lcd_line0("DRY GAP (s)");  char b[17]; snprintf(b,sizeof(b),"val:%03u Next>",edit_auto_gap_s); lcd_line1(b); }
static void show_auto_maxrun(void)  { lcd_line0("MAX RUN (min)"); char b[17]; snprintf(b,sizeof(b),"val:%03u Next>",edit_auto_maxrun_min); lcd_line1(b); }
static void show_auto_retry(void)   { lcd_line0("RETRY COUNT");   char b[17]; snprintf(b,sizeof(b),"val:%03u Next>",edit_auto_retry); lcd_line1(b); }
static void show_semi_auto(void)    { lcd_line0("Semi-Auto"); lcd_line1(semiAutoActive?"val:Disable Next>":"val:Enable  Next>"); }

void ModelHandle_1SecondTask(void)
{
    if (countdownActive && countdownDuration > 0)
    { countdownDuration--; if (countdownDuration == 0) countdownActive = false; }
}

static void show_twist(void)
{
    char l0[17];
    snprintf(l0, sizeof(l0), "Tw %02us/%02us",
             (unsigned)twistSettings.onDurationSeconds,
             (unsigned)twistSettings.offDurationSeconds);
    lcd_line0(l0); lcd_line1(twistActive ? "val:STOP   Next>" : "val:START  Next>");
}

static void show_countdown(void)
{
    char l0[17], l1[17];
    if (!countdownActive)
    {
        uint8_t pct = ModelHandle_GetTankLevelPercent();
        const char *gw = (adcData.voltages[4] <= 0.01f) ? "YES" : "NO ";
        snprintf(l0, sizeof(l0), "COUNT M:OFF%3d%%", pct);
        snprintf(l1, sizeof(l1), "G.W:%-3s    %02u:%02u", gw, time.hour, time.min);
        lcd_line0(l0); lcd_line1(l1); return;
    }
    uint32_t sec = countdownDuration, min = sec / 60, s = sec % 60;
    snprintf(l0, sizeof(l0), "CD %02lu:%02lu RUN", (unsigned long)min, (unsigned long)s);
    lcd_line0(l0); lcd_line1("DOWN=STOP      ");
}

