Amiya200/stm32_water_tank/Core/Src/screen.c
    if (ui == UI_DEVSET_MENU)
    {
        if (b == BTN_SELECT || b == BTN_SELECT_LONG)
            menu_select();
        else if (b == BTN_DOWN && devset_idx < DEVSET_MENU_COUNT - 1)
            devset_idx++;
        else if (b == BTN_UP && devset_idx > 0)
            devset_idx--;

        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_ADD_DEVICE_MENU)
    {
        if (b == BTN_UP && addDevMenuIndex > 0)
            addDevMenuIndex--;

        if (b == BTN_DOWN && addDevMenuIndex < 1)
            addDevMenuIndex++;

        if (b == BTN_SELECT || b == BTN_SELECT_LONG)
        {
            if (addDevMenuIndex == 0)
            {
                pairingInProgress = false;
                pairingComplete   = false;
                pairingTimedOut   = false;
                discoveredIndex   = 0;
                addDevTypeIndex   = 0;
                ui = UI_ADD_DEVICE_PAIR;
            }
            else
            {
                addDevTypeIndex = 0;
                ui = UI_ADD_DEVICE_REMOVE;
            }
        }

        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_ADD_DEVICE_PAIR)
    {
        uint8_t cnt = LoRa_GetDiscoveredCount();

        if (pairingComplete || pairingTimedOut)
        {
            if (b == BTN_SELECT || b == BTN_SELECT_LONG)
            {
                pairingInProgress = false;
                pairingComplete   = false;
                pairingTimedOut   = false;
                LoRa_ExitPairingMode();
                ui = UI_ADD_DEVICE_MENU;
            }

            screenNeedsRefresh = true;
            return;
        }

        if (!pairingInProgress)
        {
            if (b == BTN_SELECT || b == BTN_SELECT_LONG)
            {
                if (PairedDev_Count() >= MAX_PAIRED)
                {
                    pairingTimedOut     = true;
                    pairingDoneDispTime = HAL_GetTick();
                }
                else
                {
                    discoveredIndex = 0;

                    LoRa_ClearDiscoveredDevices();
                    LoRa_EnterPairingMode();

                    pairingInProgress   = true;
                    pairingComplete     = false;
                    pairingTimedOut     = false;
                    pairingStartTime    = HAL_GetTick();
                    pairingDoneDispTime = 0;
                }

                screenNeedsRefresh = true;
            }

            return;
        }

        if ((b == BTN_UP || b == BTN_DOWN) && cnt > 1)
        {
            if (b == BTN_UP)
                discoveredIndex = (discoveredIndex == 0) ? (cnt - 1) : (discoveredIndex - 1);
            else
                discoveredIndex = (uint8_t)((discoveredIndex + 1) % cnt);

            screenNeedsRefresh = true;
            return;
        }

        if ((b == BTN_SELECT || b == BTN_SELECT_LONG) && cnt > 0)
        {
            if (discoveredIndex >= cnt)
                discoveredIndex = 0;

            if (LoRa_PairDiscoveredDevice(discoveredIndex))
            {
                pairingInProgress   = false;
                pairingComplete     = true;
                pairingTimedOut     = false;
                pairingDoneDispTime = HAL_GetTick();
            }
            else
            {
                pairingInProgress   = false;
                pairingComplete     = false;
                pairingTimedOut     = true;
                pairingDoneDispTime = HAL_GetTick();
                LoRa_ExitPairingMode();
            }

            screenNeedsRefresh = true;
            return;
        }

        return;
    }

    if (ui == UI_ADD_DEVICE_REMOVE)
    {
        uint8_t cnt = PairedDev_Count();

        if ((b == BTN_UP || b == BTN_DOWN) && cnt > 0)
        {
            addDevTypeIndex = (uint8_t)((addDevTypeIndex + 1) % cnt);
        }
        else if (b == BTN_SELECT || b == BTN_SELECT_LONG)
        {
            if (cnt > 0)
            {
            	uint32_t removedDid = PairedDev_Get(addDevTypeIndex % cnt);

            	PairedDev_Remove(removedDid);

            	/* Important: immediately stop using old wireless ADC data */
            	LoRa_OnPairingListChanged();

            	addDevTypeIndex     = 0;
            	pairingDoneDispTime = HAL_GetTick();
            	ui = UI_ADD_DEVICE_REMOVE_DONE;
            }
            else
            {
                ui = UI_ADD_DEVICE_MENU;
            }
        }

        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_ADD_DEVICE_PAIR_DONE || ui == UI_ADD_DEVICE_REMOVE_DONE)
    {
        if (b == BTN_SELECT || b == BTN_SELECT_LONG)
        {
            ui = UI_ADD_DEVICE_MENU;
            screenNeedsRefresh = true;
        }

        return;
    }

    if (ui != UI_DASH)
    {
        if (b == BTN_UP)
            increase_edit_value(1);
        else if (b == BTN_DOWN)
            decrease_edit_value(1);
        else if (b == BTN_UP_LONG)
            increase_edit_value(5);
        else if (b == BTN_DOWN_LONG)
            decrease_edit_value(5);
        else if (b == BTN_SELECT)
            menu_select();

        screenNeedsRefresh = true;
        return;
    }
}


void Screen_Update(void)
{
    uint32_t now = HAL_GetTick();

    if (ui >= UI_MAX_)
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    if (ui == UI_WELCOME && (now - lastLcdUpdateTime >= WELCOME_MS))
    {
        lastLcdUpdateTime = now;
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    if (ui != UI_WELCOME &&
        ui != UI_DASH &&
        ui != UI_COUNTDOWN &&
        ui != UI_ADD_DEVICE_PAIR &&
        (now - lastUserAction >= AUTO_BACK_MS))
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    if (ui == UI_COUNTDOWN && (now - lastLcdUpdateTime) >= 1000UL)
    {
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    if (ui == UI_ADD_DEVICE_PAIR && pairingInProgress)
    {
        uint8_t cnt = LoRa_GetDiscoveredCount();

        if (cnt > 0 && discoveredIndex >= cnt)
        {
            discoveredIndex = 0;
            screenNeedsRefresh = true;
        }

        if ((now - pairingStartTime) >= PAIRING_UI_TIMEOUT_MS)
        {
            pairingInProgress   = false;
            pairingTimedOut     = true;
            pairingDoneDispTime = now;
            LoRa_ExitPairingMode();
            screenNeedsRefresh = true;
        }
        else if ((now - lastLcdUpdateTime) >= 1000UL)
        {
            lastLcdUpdateTime = now;
            screenNeedsRefresh = true;
        }
    }

    if (ui == UI_ADD_DEVICE_PAIR &&
        (pairingComplete || pairingTimedOut) &&
        (now - pairingDoneDispTime) >= PAIRING_DONE_HOLD_MS)
    {
        pairingComplete   = false;
        pairingTimedOut   = false;
        pairingInProgress = false;

